Repository: NSDeveloper18/CardioAlert
Catalog: *.lproj/Localizable.strings
Languages: ru, uz

source: Settings
ru: Настройки
uz: Sozlamalar

# dark
source: Dark mode
ru: Темный режим
uz: Tungi rejim

source: Edit language
ru: Изменить язык
uz: Tilni o'zgartirish

source: Existing
ru: Существующий
uz: Yaratilgan

source: New
ru: Новый
uz: Yangi

# enterEmail
source: Enter Email Address
ru: Электронная почта
uz: Elektron pochta

source: Password
ru: Пароль
uz: Parol

source: Forgot Password?
ru: Забыли пароль?
uz: Parolni unutdingizmi?

source: Re-Enter
ru: Введите повторно
uz: Qayta kiriting

# signIn
source: Login
ru: Войти
uz: Kirish

source: Sign up
ru: Регистрация
uz: Ro'yhatdan o'tish

# this_is_test
source: This test is not a comprehensive diagnosis. The results are for informational purposes only and do not constitute a qualified medical diagnosis. Consultation with a doctor is necessary for accurate recommendations.
ru: Этот тест не является полным диагнозом. Результаты носят ознакомительный характер и не являются квалифицированным медицинским диагнозом. Для получения точных рекомендаций необходима консультация врача!
uz: Ushbu test to'liq tashxis emas. Natijalar faqat ma'lumot olish uchun mo'ljallangan va malakali tibbiy tashxisni tashkil etmaydi. Aniq tashxislar uchun shifokor bilan maslahatlashishingiz kerak!

# upload_real_photo_ecg_9
source: 1. Classification of ECG images for the diagnosis of heart diseases of 9 classes. 2. The computer vision method is used with an accuracy of 86%. 3. Upload a photo of your ECG and get the result.
ru: 1. Классификация изображений ЭКГ для диагностики сердечных заболеваний 9 классов. 2. Используется метод компьютерного зрения с точностью 86%. 3. Загрузите фото ЭКГ и получите результат.
uz: 1. 9-sinf yurak kasalliklarini tashxislash uchun EKG tasvirlarining tasnifi. 2. 88% aniqlik bilan kompyuterni ko'rish usuli qo'llaniladi. 3. EKG tasvirini yuklang va natijani oling.

# upload_photo
source: Example photo:
ru: Пример фото:

source: Selected photo:
ru: Выбранное фото:

source: Select photo
ru: Выбрать фото

# about_ekg_title9
source: About ECG
ru: Про ЭКГ

# please_select_photo
source: Please select a photo
ru: Пожалуйста, выберите фото

# result_of_photo
source: Based on the photo results:
ru: Результаты на основе фото:

# get_result
source: Get the result
ru: Получить результат

# answer_all_questions
source: Please answer all questions!
ru: Пожалуйста, ответьте на все вопросы!

source: Change
ru: Изменить

source: Select
ru: Выбрать

source: Source
ru: Источник

# locationsTitle
source: Medical centers
ru: Медицинские центры

source: Map
ru: Карта

# distance_from_you
source: Distance from you to here
ru: Расстояние от вас сюда

source: km
ru: км

# address_1
source: Tashkent, Kichik xalqa Yuli street, 5A
ru: Кичик Халка Йули, 5А

# address_2
source: str. 10 Mukimiy
ru: ул. Мукимий, 7

# address_3
source: str. Mevazor 5/14
ru: ул. Мевазор, 5/14

# address_4
source: str. Mahtumquli 105
ru: ул. Махтумкули, 105

# address_5
source: str. Zulfiyahanum, 18
ru: ул. Зульфияханум, 18

# class-0
source: Anterior lateral wall infarction without Q
ru: Инфаркт передней боковой стенки без Q
uz: Q bo'lmagan old yon devor infarkti

# class-1
source: Normal
ru: Норма
uz: Norma

# class-2
source: Posterior wall infarction with Q
ru: Инфаркт задней стенки с Q
uz: Q bilan orqa devor infarkt

# class-3
source: Right bundle branch block
ru: Блокада правой ножки ПГ
uz: O'ng oyoq bloki PG

# class-4
source: Anterior septal infarction without Q
ru: Инфаркт передне-перегородочный без Q
uz: Q holda oldingi septal infarkt

# class-5
source: Posterior wall infarction without Q
ru: Инфаркт задней стенки без Q
uz: Q bo'lmagan orqa devor infarkti

# class-6
source: Anterior infarction without Q
ru: Инфаркт передний без Q
uz: Q holda oldingi infarkt

# class-7
source: Left bundle branch block
ru: Блокада левой ножки
uz: Chap oyoq bloki

# class-8
source: Anterior septal infarction with Q
ru: Инфаркт передне-перегородочной с Q
uz: Q bilan oldingi septal infarkt

# ecg_9_about_title
source: CLASSIFICATION OF ECG IMAGES FOR DIGANOSTICS OF HEART DISEASES OF 9 CLASSES
ru: КЛАССИФКАЦИЯ СНИМКОВ ЭКГ ДЛЯ ДИГАНОСТИКИ СЕРДЕЧНЫХ ЗАБОЛЕВАНИЙ 9 КЛАССОВ
uz: 9-SINF YURAK XASTALIGI DIGANOSTIKASI UCHUN EKG RASMLARINI TASNIFLASH

# ecg_9_about
source: Electrocardiography (ECG) is a non â€” invasive diagnostic technique that is used to record the electrical activity of the heart. It is performed using electrodes attached to the patient's skin, which record the electrical signals generated by the heart muscle during its contraction and relaxation. These signals are displayed as a graph (electrocardiogram), which allows you to evaluate the work of the heart.
ru: Электрокардиография (ЭКГ) — это неинвазивный метод диагностики, который используется для записи электрической активности сердца. Он осуществляется с помощью электродов, прикрепленных к коже пациента, которые фиксируют электрические сигналы, генерируемые сердечной мышцей во время ее сокращения и расслабления. Эти сигналы отображаются в виде графика (электрокардиограммы), который позволяет оценить работу сердца.
uz: Elektrokardiografiya (EKG) â€” bu yurakning elektr faolligini qayd etish uchun ishlatiladigan invaziv bo'lmagan diagnostika usuli. U bemorning terisiga biriktirilgan elektrodlar yordamida amalga oshiriladi, ular yurak mushagi qisqarishi va bo'shashishi paytida hosil bo'lgan elektr signallarini tuzatadi. Ushbu signallar yurak faoliyatini baholashga imkon beradigan grafik (elektrokardiogramma) shaklida ko'rsatiladi.

# ecg_9_shows_title
source: ECG indications:
ru: Показания к ЭКГ:
uz: EKG ko'rsatkichlari:

# ecg_9_shows
source: 1. Diagnosis of cardiovascular diseases: - Coronary heart disease (CHD), including myocardial infarction. - Angina pectoris. - Myocarditis and pericarditis. - Cardiomyopathy. 2. Assessment of the condition in case of suspected arrhythmias: - Atrial and ventricular extrasystole. - Atrial fibrillation and flutter. - Paroxysmal tachycardia. - Blockages of the heart. 3. Monitoring of the condition after previous heart diseases and surgical interventions: - After a myocardial infarction. - After heart surgery. 4. Evaluation of the effectiveness of therapy: - Taking antiarrhythmic drugs. - Monitoring the treatment of hypertension and other heart diseases. 5. Preventive examinations: - In patients with risk factors (hypertension, diabetes, hereditary predisposition). - As part of medical examinations.
ru: 1. Диагностика сердечно-сосудистых заболеваний: - Ишемическая болезнь сердца (ИБС), включая инфаркт миокарда. - Стенокардия. - Миокардиты и перикардиты. - Кардиомиопатии. 2. Оценка состояния при подозрении на аритмии: - Предсердная и желудочковая экстрасистолия. - Фибрилляция и трепетание предсердий. - Пароксизмальная тахикардия. - Блокады сердца. 3. Мониторинг состояния после перенесенных сердечных заболеваний и хирургических вмешательств: - После инфаркта миокарда. - После операций на сердце. 4. Оценка эффективности терапии: - Прием антиаритмических препаратов. - Контроль за лечением артериальной гипертензии и других сердечных заболеваний. 5. Профилактические обследования: - У пациентов с факторами риска (гипертония, диабет, наследственная предрасположенность). - В рамках медицинских осмотров.
uz: 1. Yurak-qon tomir kasalliklari diagnostikasi: - Koronar arteriya kasalligi, shu jumladan miokard infarkti. - Angina pektorisi. - Miyokardit va perikardit. - Kardiyomiyopatiyalar. 2. Aritmiyaga shubha qilinganida holatni baholash: - Atriyal va qorincha ekstrasistoliyasi. - Atriyal fibrilatsiya va chayqalish. - Paroksismal taxikardiya. - Yurak bloklari. 3. Yurak kasalliklari va jarrohlik aralashuvlaridan keyin holatni kuzatish: - Miyokard infarktidan keyin. - Yurak operatsiyalaridan keyin. 4. Terapiya samaradorligini baholash: - Antiaritmik dorilarni qabul qilish. - Arterial gipertenziya va boshqa yurak kasalliklarini davolashni nazorat qilish. 5. Profilaktik tekshiruvlar: - Xavf omillari bo'lgan bemorlarda (gipertoniya, diabet, irsiylik). - Tibbiy ko'riklar doirasida.

# ecg_9_contraindications_title
source: Contraindications to ECG:
ru: Противопоказания к ЭКГ:
uz: EKGga qarshi ko'rsatmalar:

# ecg_9_contraindications
source: An ECG is a safe procedure and has no absolute contraindications. However, in some cases, it may be difficult to conduct the study or interpret the results: 1. Technical difficulties: - Skin diseases or injuries in the places where the electrodes are applied (for example, burns, severe eczema). - Severe obesity, which can make it difficult to apply electrodes. 2. Mental states: - Uncontrolled behavior of the patient, strong excitement or fear. An ECG is an important tool in cardiology that allows you to detect various heart diseases at an early stage and monitor their treatment.
ru: ЭКГ является безопасной процедурой и не имеет абсолютных противопоказаний. Однако, в некоторых случаях могут возникнуть затруднения при проведении исследования или интерпретации результатов: 1. Технические сложности: - Кожные заболевания или повреждения в местах наложения электродов (например, ожоги, выраженная экзема). - Сильное ожирение, что может затруднить наложение электродов. 2. Психические состояния: - Неконтролируемое поведение пациента, сильное возбуждение или страх. ЭКГ является важным инструментом в кардиологии, который позволяет выявлять различные заболевания сердца на ранних стадиях и контролировать их лечение.
uz: EKG xavfsiz protsedura bo'lib, mutlaq kontrendikatsiyaga ega emas. Biroq, ba'zi hollarda tadqiqot o'tkazish yoki natijalarni talqin qilishda qiyinchiliklar bo'lishi mumkin: 1. Texnik qiyinchiliklar: - Elektrodlarni qo'llash joylarida teri kasalliklari yoki shikastlanishlar (masalan, kuyish, og'ir ekzema). - Kuchli semirish, bu elektrodlarni qo'llashni qiyinlashtirishi mumkin. 2. Ruhiy holatlar: - Bemorning nazoratsiz xatti-harakati, kuchli qo'zg'alish yoki qo'rquv. EKG kardiologiyada turli xil yurak kasalliklarini dastlabki bosqichlarida aniqlash va davolashni nazorat qilish imkonini beruvchi muhim vositadir.
